eisup_2019_docmng_integration/src/Enums/абс_НаправленияПереноса/абс_НаправленияПереноса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_НаправленияПереноса</name>
  <enumValues>
    <name>ПередачаИзДЗОВКТТК</name>
  </enumValues>
  <enumValues>
    <name>ПриемИзДЗОВКТТК</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзКТТКВФилиал</name>
  </enumValues>
  <enumValues>
    <name>ПриемИзКТТКВФилиал</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_НаправленияПереноса/ManagerModule.bsl
Функция ПолучитьПредыдущееНаправление(Направление) Экспорт
	
	Если Не ЗначениеЗаполнено(Направление) Или Направление=ПередачаИзДЗОВКТТК Тогда
		Возврат ПустаяСсылка();
	ИначеЕсли Направление=ПриемИзДЗОВКТТК Тогда
		Возврат ПередачаИзДЗОВКТТК;
	ИначеЕсли Направление=ПередачаИзКТТКВФилиал Тогда
		Возврат ПриемИзДЗОВКТТК;
	ИначеЕсли Направление=ПриемИзКТТКВФилиал Тогда
		Возврат ПередачаИзКТТКВФилиал;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСледующиеНаправления(Направление) Экспорт
	
	Направления = Новый Массив;
	
	Если ЗначениеЗаполнено(Направление) Тогда
		Если Направление=ПередачаИзДЗОВКТТК Тогда
			Направления.Добавить(ПриемИзДЗОВКТТК);
			Направления.Добавить(ПередачаИзКТТКВФилиал);
			Направления.Добавить(ПриемИзКТТКВФилиал);
		ИначеЕсли Направление=ПриемИзДЗОВКТТК Тогда
			Направления.Добавить(ПередачаИзКТТКВФилиал);
			Направления.Добавить(ПриемИзКТТКВФилиал);
		ИначеЕсли Направление=ПередачаИзКТТКВФилиал Тогда
			Направления.Добавить(ПриемИзКТТКВФилиал);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Направления;
	
КонецФункции
